app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 03 Mar 2014 06:02:22 UTC +00:00], ["text", "Hello Rails\r\n"], ["title", "Curtis"], ["updated_at", Mon, 03 Mar 2014 06:02:22 UTC +00:00]]
---
	def create
		@post = Post.new(post_params)

		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["text", "Hello Rails is great!\r\n"], ["updated_at", Mon, 03 Mar 2014 16:38:03 UTC +00:00]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :text))